"""
Основной эндпоинт регистрации

POST /api/v1/users/register

тело для регистрации

{

"first_name": "ivan", (string, обязательно, макс 50 символов, буквы , дефис, без пробела)

"last_name": "Ivanov",(string, обязательно, макс 50 символов, буквы , дефис, без пробела)

"Username": "ivan", (string, обязательно, макс 50 символов, буквы , дефис, без пробела)

"Password": "Password123!" (string, обязательно, мин 8 символов, мин 1 цифра, мин 1 строчная буква, мин 1 заглавная буква, мин 1 спецсимвол)

"captchaToken": "sdfsdfsdfsdf" (токен капчи)
}



Успешный ответ 201 Created:

{
"message": "User register"
}


Ошибка 400 ошибка капчи:

{
"message": "Captcha error"
}


Ошибка 400 пользователь существует:

{
"message": "User exiest"
}


пример запроса 


curl --location 'https://books.ru/api/v1/users/register' \
--header 'Content-Type: application/json' \
--data '{
    "firstName": "Ivan",
    "lastName": "Ivanov",
    "userName": "ivan",
    "password": "Password123!",
    "captchaToken": "03AFcWeA7Y8xqJ4..."
}'

Пошаговый алгоритм

пользователь открывает страницу регистрации. На форме он заполняет обязательные поля после чего проходит проверку капчи и нажимает кнопку Register. Frontend отправляет запрос POST /api/v1/users/register на backend. Backend получает запрос и сначала проверяет наличие всех обязательных полей. Если хотя бы одно поле отсутствует или пустое, система возвращает ошибку валидации и завершает обработку запроса. Если все поля заполнены, backend проверяет валидность токена капчи через сервис гугл. Если капча не пройдена , пользователю возвращается сообщение "капча не пройден", после чего процесс завершается. Если капча успешно подтверждена, система выполняет проверку пароля. Пароль должен содержать не менее 8 символов, как минимум одну заглавную букву, одну строчную букву, одну цифру и один специальный символ. При несоответствии хотя бы одному из требований система возвращает сообщение об ошибке пароля и завершает процесс регистрации. Если пароль соответствует всем требованиям, backend выполняет поиск пользователя по полю UserName в базе данных. Если пользователь с таким логином уже существует, система возвращает сообщение "такой пользователь уже есть" и прекращает дальнейшую обработку. Если логин свободен, в базе данных создается новая запись пользователя. После успешного сохранения данных транзакция фиксируется, и backend возвращает ответ с кодом HTTP 201 Created и сообщением "регитсрация успешно заверешна". Frontend отображает пользователю сообщение об успешной регистрации и кнопку OK.

"""

